holiday/app/controllers/holidays_controller.rb

  def index
@holiday = Holiday.all
---
SELECT * FROM "holidays" LIMIT 1

  def show
login_required

@holiday = Holiday.find(params[:id])
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 1)

  def edit
  @holiday= Holiday.find(params[:id])
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 1)

  def update
  	@holiday = Holiday.find(params[:id])
if@holiday.save
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 1)
UPDATE "holidays" SET "approved" = 't', "updated_at" = '2012-01-27 10:03:40', "comments" = '', "declined" = 'f' WHERE "id" = 4

  def create
    @holiday = Holiday.create(params[:holiday])
    @holiday.user_id = current_user.id

if@holiday.save
---
INSERT INTO "holidays" ("created_at", "comments", "updated_at", "approved", "declined", "datereturning", "user_id", "dateleaving") VALUES('2012-01-27 00:17:58', NULL, '2012-01-27 00:17:58', NULL, NULL, NULL, NULL, '2011-10-10')
UPDATE "holidays" SET "updated_at" = '2012-01-27 00:17:58', "user_id" = 1 WHERE "id" = 2

def destroy
  @holiday = Holiday.find(params[:id])
  @holiday.destroy
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 2)
DELETE FROM "holidays" WHERE "id" = 2