holiday/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "admin", "password_salt", "fname", "password_hash", "email", "sname") VALUES('2012-01-27 00:17:44', '2012-01-27 00:17:44', 'Admin', NULL, '2aa2f836f236c1ad29aa53ba72d8511dcec93396', 'Antony', '813aa3df59e3c15c6ae13e8a6d85f6dd95b88305', 'antynwa@gmail.com', 'Shimmin')